diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>DefinedType.ВКМ_Сумма</types>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ Агаев Диплом 15.06.2024
	
	ВКМ_ВывестиЭлементыДляВидаАбонентскаяПлата();
		
	// --
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Агаев Диплом 15.06.2024
	
	ВКМ_УстановитьВидимостьЭлементовВидаАбонентскаяПлата();
		
	// --

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ВывестиЭлементыДляВидаАбонентскаяПлата()
	
	// ++ Агаев Диплом 15.06.2024
	
	ВидАбоненскоеОбслуживание = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание;
	
	
	ГруппаПериода = Элементы.Добавить("ГруппаПериода", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаПериода.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериода.ОтображатьЗаголовок = Ложь;
	ГруппаПериода.Видимость = ВидАбоненскоеОбслуживание;
	ГруппаПериода.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ГруппаПериода.Заголовок = "";
	
	РеквизитДатаНачалаДействия = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"), ГруппаПериода);
	РеквизитДатаНачалаДействия.Вид = ВидПоляФормы.ПолеВвода;
	РеквизитДатаНачалаДействия.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
	РеквизитДатаНачалаДействия.Заголовок = "Период";
	
	ДекорацияТире = Элементы.Добавить("Тире", Тип("ДекорацияФормы"), ГруппаПериода);
	ДекорацияТире.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияТире.Заголовок = " - ";
	
	РеквизитДатаОкончанияДействия = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"), ГруппаПериода);
	РеквизитДатаОкончанияДействия.Вид = ВидПоляФормы.ПолеВвода;
	РеквизитДатаОкончанияДействия.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	РеквизитДатаОкончанияДействия.Заголовок = " ";
	
	РеквизитСумма = Элементы.Добавить("СуммаАбонентскойПланы", Тип("ПолеФормы"), ЭтотОбъект);
	РеквизитСумма.Вид = ВидПоляФормы.ПолеВвода;
	РеквизитСумма.Видимость = ВидАбоненскоеОбслуживание;
	РеквизитСумма.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	РеквизитСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ЭтотОбъект);
	РеквизитСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	РеквизитСтоимостьЧасаРаботы.Видимость = ВидАбоненскоеОбслуживание;
	РеквизитСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	// --
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_УстановитьВидимостьЭлементовВидаАбонентскаяПлата()
	
	// ++ Агаев Диплом 15.06.2024
	
	ВидАбоненскоеОбслуживание = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание;
	
	Элементы.ГруппаПериода.Видимость = ВидАбоненскоеОбслуживание;
	Элементы.СуммаАбонентскойПланы.Видимость = ВидАбоненскоеОбслуживание;
	Элементы.СтоимостьЧасаРаботы.Видимость = ВидАбоненскоеОбслуживание;
	
	Если ВидАбоненскоеОбслуживание Тогда
		
		Объект.ВКМ_ДатаНачалаДействия = "";
		Объект.ВКМ_ДатаОкончанияДействия = "";
		Объект.ВКМ_СуммаАбонентскойПлаты = 0;
		Объект.ВКМ_СтоимостьЧасаРаботы = 0;

	КонецЕсли;
	
	// --
	
КонецПроцедуры

#КонецОбласти
